# Parameter Filter Rule Factory Create Equals Rule Method

Source: https://www.revitapidocs.com/2026/0637b53b-96aa-7683-6535-8a1217c5809e.htm

---

| Parameter Filter Rule Factory Create Equals Rule Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateEqualsRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document equal a certain value. |
|  | CreateEqualsRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document equal a certain value. |
|  | CreateEqualsRule(ElementId, String) | Creates a filter rule that determines whether strings from the document equal a certain value. |
|  | CreateEqualsRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document equal a certain value. |

Top See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace